KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL31.svd
00: Vinput = 1.2V

01: reserved (not used for this cut)

10: Vinput = 2.4V

11: Vinput = 3.6V</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SE_VIN_4</name>
              <description>SE_VIN_4[1:0]: input voltage for VINP[0]

00: Vinput = 1.2V

01: reserved (not used for this cut)

10: Vinput = 2.4V

11: Vinput = 3.6V</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SE_VIN_5</name>
              <description>SE_VIN_5[1:0]: input voltage for VINP[1]

00: Vinput = 1.2V

01: reserved (not used for this cut)

10: Vinput = 2.4V

11: Vinput = 3.6V</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SE_VIN_6</name>
              <description>SE_VIN_6[1:0]: input voltage for VINP[2]

00: Vinput = 1.2V

01: reserved (not used for this cut)

10: Vinput = 2.4V

11: Vinput = 3.6V</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SE_VIN_7</name>
              <description>SE_VIN_7[1:0]: input voltage for VINP[3]

00: Vinput = 1.2V

01: reserved (not used for this cut)

10: Vinput = 2.4V

11: Vinput = 3.6V</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DS_CONF</name>
          <displayName>DS_CONF</displayName>
          <description>DS_CONF register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>DS_RATIO</name>
              <description>DS_RATIO[2:0]: program the Down Sampler ratio (N factor)

000: ratio = 1, no down sampling (default)

001: ratio = 2

010: ratio = 4

011: ratio = 8

100: ratio = 16

101: ratio = 32

110: ratio = 64

111: ratio = 128</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DS_WIDTH</name>
              <description>DS_WIDTH[2:0]: program the Down Sampler width of data output (DSDTATA)

000: DS_DATA output on 12-bit (default)

001: DS_DATA output on 13-bit

010: DS_DATA output on 14-bit

011: DS_DATA output on 15-bit

100: DS_DATA output on 16-bit

1xx: reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQ_1</name>
          <displayName>SEQ_1</displayName>
          <description>SEQ_1 register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>SEQ0</name>
              <description>SEQ0[3:0]: channel number code for first conversion of the sequence

0000: VINM[0] to ADC single negative input

0001: VINM[1] to ADC single negative input

0010: VINM[2] to ADC single negative input

0011: VINM[3] to ADC single negative input

0100: VINP[0] to ADC single positive input

0101: VINP[1] to ADC single positive input

0110: VINP[2] to ADC single positive input

0111: VINP[3] to ADC single positive input

1000: VINP[0]-VINM[0] to ADC differential input

1001: VINP[1]-VINM[1] to ADC differential input

1010: VINP[2]-VINM[2] to ADC differential input

1011: VINP[3]-VINM[3] to ADC differential input

1100: VBAT - Battery level detector

1101: Temperature sensor

111x: reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ1</name>
              <description>SEQ1[3:0]: channel number code for second conversion of the sequence.

See SEQ0 for code detail.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ2</name>
              <description>SEQ2[3:0]: channel number code for 3rd conversion of the sequence.

See SEQ0 for code detail.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ3</name>
              <description>SEQ3[3:0]: channel number code for 4th conversion of the sequence.

See SEQ0 for code detail.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ4</name>
              <description>SEQ4[3:0]: channel number code for 5th conversion of the sequence.

See SEQ0 for code detail.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ5</name>
              <description>SEQ5[3:0]: channel number code for 6th conversion of the sequence.

See SEQ0 for code detail.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ6</name>
              <description>SEQ6[3:0]: channel number code for 7th conversion of the sequence.

See SEQ0 for code detail.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ7</name>
              <description>SEQ7[3:0]: channel number code for 8th conversion of the sequence.

See SEQ0 for code detail.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQ_2</name>
          <displayName>SEQ_2</displayName>
          <description>SEQ_2 register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>SEQ8</name>
              <description>SEQ8[3:0]: channel number code for 9th conversion of the sequence

0000: VINM[0] to ADC single negative input

0001: VINM[1] to ADC single negative input

