KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL31.svd
0010: VINM[2] to ADC single negative input

0011: VINM[3] to ADC single negative input

0100: VINP[0] to ADC single positive input

0101: VINP[1] to ADC single positive input

0110: VINP[2] to ADC single positive input

0111: VINP[3] to ADC single positive input

1000: VINP[0]-VINM[0] to ADC differential input

1001: VINP[1]-VINM[1] to ADC differential input

1010: VINP[2]-VINM[2] to ADC differential input

1011: VINP[3]-VINM[3] to ADC differential input

1100: VBAT - Battery level detector

1101: Temperature sensor

111x: reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ9</name>
              <description>SEQ9[3:0]: channel number code for 10th conversion of the sequence.

See SEQ0 for code detail.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ10</name>
              <description>SEQ10[3:0]: channel number code for 11th conversion of the sequence.

See SEQ0 for code detail.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ11</name>
              <description>SEQ11[3:0]: channel number code for 12th conversion of the sequence.

See SEQ0 for code detail.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ12</name>
              <description>SEQ12[3:0]: channel number code for 13th conversion of the sequence.

See SEQ0 for code detail.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ13</name>
              <description>SEQ13[3:0]: channel number code for 14th conversion of the sequence.

See SEQ0 for code detail.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ14</name>
              <description>SEQ14[3:0]: channel number code for 15th conversion of the sequence.

See SEQ0 for code detail.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ15</name>
              <description>SEQ15[3:0]: channel number code for 16th conversion of the sequence.

See SEQ0 for code detail.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_1</name>
          <displayName>COMP_1</displayName>
          <description>COMP_1 register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00555</resetValue>
          <resetMask>0xFFFFF</resetMask>
          <fields>
            <field>
              <name>GAIN1</name>
              <description>GAIN1[11:0]: first calibration point: gain AUXADC_GAIN_1V2[11:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET1</name>
              <description>OFFSET1[7:0]: first calibration point</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_2</name>
          <displayName>COMP_2</displayName>
          <description>COMP_2 register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00555</resetValue>
          <resetMask>0xFFFFF</resetMask>
          <fields>
            <field>
              <name>GAIN2</name>
              <description>GAIN2[11:0]: second calibration point: gain AUXADC_GAIN_1V2[11:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET2</name>
              <description>OFFSET2[7:0]: second calibration point</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_3</name>
          <displayName>COMP_3</displayName>
          <description>COMP_3 register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00555</resetValue>
          <resetMask>0xFFFFF</resetMask>
          <fields>
            <field>
              <name>GAIN3</name>
              <description>GAIN3[11:0]: third calibration point: gain AUXADC_GAIN_1V2[11:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET3</name>
              <description>OFFSET3[7:0]: third calibration point</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_4</name>
          <displayName>COMP_4</displayName>
          <description>COMP_4 register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00555</resetValue>
          <resetMask>0xFFFFF</resetMask>
          <fields>
            <field>
              <name>GAIN4</name>
              <description>GAIN4[11:0]: fourth calibration point: gain AUXADC_GAIN_1V2[11:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET4</name>
              <description>OFFSET4[7:0]: fourth calibration point</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_SEL</name>
          <displayName>COMP_SEL</displayName>
          <description>COMP_SEL register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>OFFSET_GAIN0</name>
              <description>OFFSET_GAIN0[1:0]: gain / offset used in ADC single negative mode with Vinput range =

