KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL31.svd
0: No transfer complete (TC) event on channel 6

1: A transfer complete (TC) event occurred on channel 6</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF6</name>
              <description>HTIF6: Channel 6 half transfer flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No half transfer (HT) event on channel 6

1: A half transfer (HT) event occurred on channel 6</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TE1F6</name>
              <description>TEIF6: Channel 6 transfer error flag                                                                                                                                                                                                                    This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No transfer error (TE) on channel 6

1: A transfer error (TE) occurred on channel 6</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GIF7</name>
              <description>GIF7: Channel 7 global interrupt flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No TE, HT or TC event on channel 7

1: A TE, HT or TC event occurred on channel 7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF7</name>
              <description>TCIF7: Channel 7 transfer complete flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No transfer complete (TC) event on channel 7

1: A transfer complete (TC) event occurred on channel 7</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF7</name>
              <description>HTIF7: Channel 7 half transfer flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No half transfer (HT) event on channel 7

1: A half transfer (HT) event occurred on channel 7</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TE1F7</name>
              <description>TEIF7: Channel 7 transfer error flag                                                                                                                                                                                                                    This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No transfer error (TE) on channel 7

1: A transfer error (TE) occurred on channel 7</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GIF8</name>
              <description>GIF8: Channel 8 global interrupt flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No TE, HT or TC event on channel 8

1: A TE, HT or TC event occurred on channel 8</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF8</name>
              <description>TCIF8: Channel 8 transfer complete flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No transfer complete (TC) event on channel 8

1: A transfer complete (TC) event occurred on channel 8</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF8</name>
              <description>HTIF8: Channel 8 half transfer flag

This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No half transfer (HT) event on channel 8

1: A half transfer (HT) event occurred on channel 8</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TE1F8</name>
              <description>TEIF8: Channel 8 transfer error flag                                                                                                                                                                                                                    This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.

0: No transfer error (TE) on channel 8

1: A transfer error (TE) occurred on channel 8</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_IFCR</name>
          <displayName>DMA_IFCR</displayName>
          <description>DMA_IFCR register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CGIF1</name>
              <description>CGIF1: Channel 1 global interrupt clear

This bit is set and cleared by software.

