KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL31.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MISC</name>
      <groupName>MISC</groupName>
      <baseAddress>0x49000700</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RFIP_VERSION</name>
          <displayName>RFIP_VERSION</displayName>
          <description>RFIP_VERSION register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00001200</resetValue>
          <fields>
            <field>
              <name>REVISION</name>
              <description>Revision of the MR_SubG (to be used for metal fixes)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VERSION</name>
              <description>Version of the MR_SubG (to be used for cut upgrades)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRODUCT</name>
              <description>Used for major upgrades (new protocols support / new features)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RRM_UDRA_CTRL</name>
          <displayName>RRM_UDRA_CTRL</displayName>
          <description>RRM_UDRA_CTRL register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RRM_CMD_REQ</name>
              <description>Action bit: write 1 to request a RRM-UDRA command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQUENCER_CTRL</name>
          <displayName>SEQUENCER_CTRL</displayName>
          <description>SEQUENCER_CTRL register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GEN_SEQ_TRIGGER</name>
              <description>Action bit: write 1 to generate a trigger event on Sequencer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_SEQ</name>
              <description>Enable/disable the Sequencer
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ABSOLUTE_TIME</name>
          <displayName>ABSOLUTE_TIME</displayName>
          <description>ABSOLUTE_TIME register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ABSOLUTE_TIME</name>
              <description>Indicate the interpolated absolute.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCM_COUNTER_VAL</name>
          <displayName>SCM_COUNTER_VAL</displayName>
          <description>SCM_COUNTER_VAL register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SCM_COUNTER_CURRVAL</name>
              <description>Slow Clock Measurement: number of 16 MHz clock cycles contained in 32 slow clock periods.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCM_MIN_MAX</name>
          <displayName>SCM_MIN_MAX</displayName>
          <description>SCM_MIN_MAX register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00007FFF</resetValue>
          <fields>
            <field>
              <name>SCM_COUNTER_MINVAL</name>
              <description>Slow Clock Measurement: minimum SCM_COUNTER value seen since the counter is ON and since last clear request.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SCM_COUNTER_MAXVAL</name>
              <description>Slow Clock Measurement: maximum SCM_COUNTER value seen since the counter is ON and since last clear request.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLEAR_MIN_MAX</name>
              <description>Write 1' to clear the SCM_COUNTER_MINVAL and SCM_COUNTER_MAXVAL bit fields.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKEUP_IRQ_STATUS</name>
          <displayName>WAKEUP_IRQ_STATUS</displayName>
          <description>WAKEUP_IRQ_STATUS register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_WAKEUP_F</name>
              <description>Set when the interpolated absolute time matches the CPU_WAKEUPTIME while WAKEUP_CTRL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFIP_WAKEUP_F</name>
              <description>Set when the interpolated absolute time matches the RFIP_WAKEUPTIME while WAKEUP_CTRL.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
