KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL31.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWRC</name>
      <groupName>PWRC</groupName>
      <baseAddress>0x48500000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xA8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PVD</name>
        <description>PVD / BORH</description>
        <value>2</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>CR1 register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x114</resetValue>
          <fields>
            <field>
              <name>LPMS</name>
              <description>LPMS Low Power Mode Selection
Selection of the low power mode entered when CPU enters DEEP SLEEP mode and BLE is rdy2sleep.
- 0: Deep Stop mode (default)
- 1: Shutdown mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENSDNBOR</name>
              <description>ENSDNBOR: Enable BOR supply monitoring during shutdown mode.
- 1: the PD_ALL_SHUTDOWN signal is not set during SHUTDOWN mode
- 0: the PD_ALL_SHUTDOWN signal is set during SHUTDOWN mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIAS_RUN_AUTO</name>
              <description>IBIAS_RUN_AUTO: Enable automatic IBIAS control during RUN/DEEPSTOP mode.
- 0: IBIAS control is manual (and controlled by IBIAS_RUN_STATE register)
- 1: IBIAS control is automatic (default).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIAS_RUN_STATE</name>
              <description>IBIAS_RUN_STATE: Enable/Disable IBIAS during RUN mode when automatic mode is
disabled.
- 0: IBIAS control is disabled (default).
- 1: IBIAS control is enabled.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APC</name>
              <description>APC Apply Pull-up and pull-down configuration from CPU
- 1: the I/O pull-up and pull-down configurations defined in the PUCRx and PDCRx registers is applied. 
- 0: the PUCRx and PDCRx are not used to control the I/O pull-up and pull-down configuration of the product I/Os.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENBORH</name>
              <description>ENBORH: enable BORH configuration
- 1: BORH is enabled, threshold level depends on SELBOR[1:0]
- 0: BORH off (VBOR0):  threshold level for above 1.60V voltage operation.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELBORH</name>
              <description>SELBORH[1:0]: BORH selection of Vbor threshold
- 11: BORH Level 4(VBOR4):  threshold level for above 2.81 V voltage operation.
- 10: BORH Level 3 (VBOR3):  threshold level for above 2.52 V voltage operation
- 01: BORH Level 2 (VBOR2):  threshold level for above 2.21 V voltage operation
- 00: BORH Level 1 (VBOR1):  threshold level for above 2.0V voltage operation.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENBORL</name>
              <description>ENBORL: Enable BORL reset supervising during RUN mode.
- 0: No BORL is monitored during RUN mode.
- 1: BORL is monitored during RUN mode (a POR reset will happen if VDDIO goes below 1.6V during RUN mode) (default).
Note: Enabling this feature prevents blocking the device if VDDIO goes below supported voltages during RUN.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>CR2 register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>PVDE</name>
              <description>PVDE Programmable Voltage Detector Enable
When this bit is set the Power Voltage Detector is enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVDLS</name>
              <description>PVDLS[2:0] Programmable Voltage Detector Level selection
- 000: 2.05 V - Lowest level
- 001: 2.20 V
- 010: 2.36 V
- 011: 2.52 V
- 100: 2.64 V
- 101: 2.81 V
- 110: 2.91 V - Highest level
- 111: External input analog voltage (compare internally to VBGP; When external input  VBGP
then PVDO=1)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBGRET</name>
              <description>DBGRET: PA2 and PA3 retention enable after DEEPSTOP
- 0: PA2, PA3 don't retain their status exiting from DEEPSTOP (default).
- 1: PA2, PA3 retain their status exiting from DEEPSTOP.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAMRET1</name>
              <description>RAMRET1: RAM1 retention during low power mode
- 1: RAM1 bank is powered during low power mode 
- 0: RAM1 bank is disabled during low power mode (by default)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPREG_FORCE_VH</name>
              <description>force LPREG=1.2V during DEEPSTOP
- 1: Force LPREG=1.2V during DEEPSTOP
- 0: No Force (Default)
Note LPREG= 1.2v can still apply when LCDEN or COMP.SCALEREN request it</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPREG_VH_STATUS</name>
              <description>status LPREG VH (1.2v) during DEEPSTOP
- 1: LPREG=1.2V during DEEPSTOP
- 0: LPREG=1V during DEEPSTOP</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIORET</name>
              <description>GPIORET: GPIO retention enable.
- 0: Release GPIO retention after deepstop (Should be reset after restore Context)
- 1: Enable GPIO Retention during deepstop (Must be set before deepstop)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENTS</name>
              <description>ENTS: Enable Temperature Sensor
- 1: Temperature sensor is enabled
- 0: Temperature sensor is disabled</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFREGEN</name>
              <description>RFREGEN: RF Regulator Enable
- 1: Enable RF Regulator
- 0: Disable RF Regulator (Note: RF Regulator can still be enabled by the RFSUGB or RCC_CR.HSEON)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFREGCEXT</name>
              <description>RFREGCEXT: RF Regulator External Supply Bypass
- 1: External supply bypass capability 
- 0: Internal supply only</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFREGBYP</name>
              <description>RFREGBYP: RF Regulator Bypass Enable
- 1: LDO output connected to VSMPS.
- 0: internally generated 1.2V</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFREGRDY</name>
              <description>RFDREGRDY: RF Regulator Ready flag
- 1: RF Regulator is ready
- 0: RF Regulator is not ready</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RFREGON_STATUS</name>
              <description>RFREGON_STATUS:  RF Regulator On Status 
- 1:  RF Regulator is enabled 
- 0:  RF Regulator is disabled</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEWU</name>
          <displayName>IEWU</displayName>
          <description>IEWU register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>EIWL0</name>
              <description>EWL0 Enable Internal WakeUp line LPUART
When this bit is set the internal wakeup line is enabled and a rising edge will trigger a CPU wakeup event.
- 0: wakeup disabled.
- 1: wakeup enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EIWL1</name>
              <description>EIWL1 Enable Internal WakeUp line RTC
When this bit is set the internal wakeup line is enabled and a rising edge will trigger a CPU wakeup event.
- 0: wakeup disabled.
- 1: wakeup enabled.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EIWL2</name>
              <description>EIWL2 Enable Internal WakeUp line LCD
When this bit is set the internal wakeup line is enabled and a rising edge will trigger a CPU wakeup event.
- 0: wakeup disabled.
- 1: wakeup enabled.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EIWL3</name>
              <description>EIWL3 Enable Internal Wakeup line COMP 
When this bit is set the COMP wakeup is enabled and an  edge will trigger a COMP wakeup event
- 0: wakeup disabled.
- 1: wakeup enabled.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EIWL4</name>
              <description>EIWL4 Enable Internal Wakeup line LCSC 
When this bit is set the LCSC wakeup is enabled and an  edge will trigger a LCSC wakeup event
- 0: wakeup disabled.
- 1: wakeup enabled.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EWMRSUBG</name>
              <description>EWMRSUB Wakeup MRSUBG Enable
When this bit is set the MRSUBG wakeup is enabled and a rising edge will trigger a MRSUBG wakeup event
- 0: MRSUBG wakeup disabled.
- 1: MRSUBG wakeup enabled.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EWMRSUBGHCPU</name>
              <description>EWMRSUBGHCPU Wakeup MRSUBG Host CPU Enable
When this bit is set the MRSUBG HOST CPU wakeup is enabled and a rising edge will trigger a MRSUBG Host CPU wakeup event
- 0: MRSUBG Host CPU wakeup disabled.
- 1: MRSUBG Host CPU wakeup enabled.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EWLPAWUR</name>
              <description>EWLPAWUR: Wakeup Bubble Enable
When this bit is set the Bubble wakeup is enabled and a rising edge will trigger a LPAWUR wakeup event
- 0: LPAWUR wakeup disabled.
- 1: LPAWUR wakeup enabled.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IWUP</name>
          <displayName>IWUP</displayName>
          <description>IWUP register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>IWUP0</name>
              <description>IWUP0: Wakeup polarity for internal wakeup line 0 event (LPUART).
- 0: Detection of wakeup event on rising edge (default).
- 1: Detection of wakeup event on falling edge.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IWUP1</name>
              <description>IWUP1: Wakeup polarity for internal wakeup line 1 event (RTC).
- 0: Detection of wakeup event on rising edge (default).
- 1: Detection of wakeup event on falling edge.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IWUP2</name>
              <description>IWUP2: Wakeup polarity for internal wakeup line 2 event (LCD).
- 0: Detection of wakeup event on rising edge (default).
- 1: Detection of wakeup event on falling edge.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IWUP3</name>
              <description>IWUP3: Wakeup polarity for internal wakeup line 3 event (COMP).
- 0: Detection of wakeup event on rising edge (default).
- 1: Detection of wakeup event on falling edge.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IWUP4</name>
              <description>IWUP4: Wakeup polarity for internal wakeup line 4 event (LCSC).
- 0: Detection of wakeup event on rising edge (default).
- 1: Detection of wakeup event on falling edge.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WMRSUBGHP</name>
              <description>WMRSUBGHP: Wakeup polarity for internal wakeup MRSUBG event
- 0: Detection of wakeup event on rising edge (default).
- 1: Detection of wakeup event on falling edge.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WMRSUBGHCPUP</name>
              <description>WMRSUBGHCPUP: Wakeup polarity for internal wakeup MRSUBG Host CPU event
- 0: Detection of wakeup event on rising edge (default).
- 1: Detection of wakeup event on falling edge.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WLPAWURP</name>
              <description>WLPAWURP: Wakeup polarity for wakeup LPAWUR event.
- 0: Detection of wakeup event on rising edge (default).
- 1: Detection of wakeup event on falling edge.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IWUF</name>
          <displayName>IWUF</displayName>
          <description>IWUF register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>IWUF0</name>
              <description>IWUF0: Internal wakeup flag (LPUART).
- 0: no wakeup from LPUART occurred since last clear.
- 1: a wakeup from LPUART occurred since last clear.
Cleared by writing 1 in this bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IWUF1</name>
              <description>IWUF1: Internal wakeup flag (RTC).
- 0: no wakeup from RTC occurred since last clear.
- 1: a wakeup from RTC occurred</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IWUF2</name>
              <description>IWUF2: Internal wakeup flag (LCD).
- 0: no wakeup from LCD occurred since last clear.
- 1: a wakeup from LCD occurred since last clear.
Cleared by writing 1 in this bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IWUF3</name>
              <description>IWUF3: Internal wakeup flag (COMP).
- 0: no wakeup from COMP occurred since last clear.
- 1: a wakeup from COMP occurred since last clear.
Cleared by writing 1 in this bit.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IWUF4</name>
              <description>IWUF4: Internal wakeup flag (LCSC).
- 0: no wakeup from LCSC occurred since last clear.
- 1: a wakeup from LCSC occurred since last clear.
Cleared by writing 1 in this bit.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WMRSUBGF</name>
              <description>WMRSUBGF Wakeup MRSUBG Flag
This bit is set by hardware when a MRSUBG wakeup is detected 
It is cleared by a reset pad or by software writing 1 in this bit field.
- 0: No MRSUBG Wakeup detected
- 1: MRSUBG Wakeup detected
writting 1 in this bit, clears the interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WMRSUBGHCPUF</name>
              <description>WMRSUBGHCPUF Wakeup MRSUBG HOST CPU Flag (cf. user manual)
This bit is set by hardware when a MRSUBG HOST CPU wakeup is detected 
It is cleared by a reset pad or by software writing 1 in this bit field.
- 0: No MRSUBG Host CPU wakeup detected
- 1: MRSUBG Host CPU wakeup detected
writting 1 in this bit, clears the interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WLPAWURF</name>
              <description>WLPAWURF Wakeup LPAWUR Flag (cf. user manual)
This bit is set by hardware when a LPAWUR wakeup is detected 
It is cleared by a reset pad or by software writing 1 in this bit field.
- 0: No LPAWUR wakeup detected
- 1: LPAWUR wakeup detected
writting 1 in this bit, clears the interrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
