KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL31.svd
        <register>
          <name>SR2</name>
          <displayName>SR2</displayName>
          <description>SR2 register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xF3F6</resetValue>
          <fields>
            <field>
              <name>SMPSBYPR</name>
              <description>SMPSBYPR: SMPS Force Bypass Control Replica
This bit mirrors the actual BYPASS_3V3 control signal driven to the SMPS regulator, dependant on the real working state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SMPSENR</name>
              <description>SMPSENR: SMPS Enable Control Replica
This bit mirrors the actual ENABLE_3V3 control signal driven to the SMPS regulator, dependant on the real working state.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SMPSRDY</name>
              <description>SMPSRDY: SMPS Ready Status
This bit provides the information whether SMPS is ready. 
- 0: SMPS regulator is not ready 
- 1: SMPS regulator is ready.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IOBOOTVAL2</name>
              <description>Bit3: PB15  input value on VDD33 latched at POR
Bit2: PB14  input value on VDD33 latched at POR
Bit1: PB13  input value on VDD33 latched at POR
Bit0: PB12 input value on VDD33 latched at POR</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REGLPS</name>
              <description>REGLPS: Regulator Low Power Started
This bit provides the information whether low power regulator is ready. 
- 0: LP regulator is not ready.
- 1: LP regulator is ready.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REGMS</name>
              <description>REGMS: Main regulator ready status.
- 0: The Main regulator is not ready.
- 1: The Main regulator is ready.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PVDO</name>
              <description>PVDO: Power Voltage Detector Output
When the Power Voltage Detector is enabled (CR2.PVDE) this bit is set when the system supply (VDDIO) is
lower than the selected PVD threshold (CR2.PVDLS)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IOBOOTVAL</name>
              <description>Bit3: PA11  input value on VDD33 latched at POR
Bit2: PA10  input value on VDD33 latched at POR
Bit1: PA9  input value on VDD33 latched at POR
Bit0: PA8 input value on VDD33 latched at POR</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR5</name>
          <displayName>CR5</displayName>
          <description>CR5 register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x6014</resetValue>
          <fields>
            <field>
              <name>SMPSLVL</name>
              <description>SMPSLVL[3:0] SMPS Output Level Voltage Selection
Select the SMPS output voltage with a granularity of 50mV. Default = '0100' (1.4V)
Vout = 1.2 + 0.05*SMPSOUT (V)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPSBOMSEL</name>
              <description>SMPSBOMSEL: SMPS BOM Selection:
- 00: BOM1
- 01: BOM2 (default)
- 10: BOM3
- 11: n/a</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPS_BOF_STATIC</name>
              <description>SMPS_BOF_STATIC: SMPS Bypass on the Fly static
- 0 : disabled (by default)
- 1 : SMPS Bypass on  the fly static is enabled (EN_SW=1)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NOSMPS_BOF</name>
              <description>NOSMPS_BOF: No SMPS Mode to be used in accordance to SMPS_BOF_STATIC =1  
When this bit is set, the SMPS regulator will be disabled. Note that this configuration should be used only SMPS_BOF_STATIC=1.
- 0 : No effect, SMPS is enabled. (default)
- 1 : SMPS is disabled;</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPSLPOPEN</name>
              <description>SMPSLPOPEN: In Low Power mode SMPS is in OPEN mode (instead of PRECHARGE mode).
When this bit is set, when the chip is in Low power mode the SMPS regulator will be disabled (HZ) Documentation needed.
- 0 : in Low Power mode, SMPS is in PRECHARGE, output is connected to VDDIO. (default)
- 1 : in Low Power mode, SMPS is disabled, output is floating</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPSFBYP</name>
              <description>SMPSFB Force SMPS Regulator in bypass mode
When this bit is set, the SMPS regulator will be forced to operate in precharge mode. the actual state of  SMPS can be observed thanks to the replica SR2.SMPSBYPR.
- 0 : no effect (by default)
- 1 : SMPS is disabled and bypassed (ENABLE_3V3=0 and PRECHARGE_3V3=1)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NOSMPS</name>
              <description>NOSMPS: No SMPS Mode  
When this bit is set, the SMPS regulator will be disabled. Note that this configuration should be used only when SMPS_FB pad is directly connected to VBATT or Vext, without L/C BOM.
- 0 : No effect, SMPS is enabled. (Default)
- 1 : SMPS is disabled;</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPS_ENA_DCM</name>
              <description>SMPS_ENA_DCM: enable discontinuous conduction mode
- 0 : disable (Default)
- 1 : enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKDETR_DISABLE</name>
              <description>CLKDETR_DISABLE: disable SMPS clock detection
The SMPS clock detection enables an automatic SMPS bypass switching in case of unwanted loss of SMPS clock.
- 0 : SMPS clock detection enabled (default)
- 1 : SMPS clock detection disabled</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPS_PRECH_CUR_SEL</name>
              <description>SMPS_PRECH_CUR_SEL[1:0] Selection for SMPS PRECHARGE limit current
- 00: 2.5mA 
- 01: 5mA
- 10: 10mA 
- 11: 20mA (default)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPS_BOF_DYN</name>
              <description>SMPS_BOF_DYN: SMPS Bypass on the Fly dynamic
- 0 : disabled (by default)
- 1 : SMPS Bypass on  the fly dynamic is enabled (EN_LDO=1)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUCRA</name>
          <displayName>PUCRA</displayName>
          <description>PUCRA register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFF7</resetValue>
          <fields>
            <field>
              <name>PUA</name>
              <description>PUA[x] : Pull Up Port A
Pull up activation on port A[i] pad when APC bit of PWRC CR1 is set
- 1: Pull-Up activated on port A[i] when APC bit of PWRC CR1 bit is set and PWR_PDCRA[x] is reset
- 0: Pull-Up not activated on port A[i]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRA</name>
          <displayName>PDCRA</displayName>
          <description>PDCRA register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <fields>
            <field>
              <name>PDA</name>
              <description>PDA[x]: Pull Down Port A
Pull Down activation on port A[i] pad when APC bit of PWRC CR1 is set
- 1: Pull-Down activated on Port A[i] when APC bit of PWRC CR1 bit is set
- 0: Pull-Down not activated on Port A[i]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUCRB</name>
          <displayName>PUCRB</displayName>
          <description>PUCRB register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <fields>
            <field>
              <name>PUB</name>
              <description>PUB[x] : Pull Up Port B
Pull up activation on port B[i] pad when APC bit of PWRC CR1 is set
- 1: Pull-Up activated on port B[i] when APC bit of PWRC CR1 bit is set and PWR_PDCRB[x] is reset
- 0: Pull-Up not activated on port B[i]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRB</name>
          <displayName>PDCRB</displayName>
          <description>PDCRB register</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>PDB</name>
              <description>PDB[x]: Pull Down Port B
Pull Down activation on port B[i] pad when APC bit of PWRC CR1 is set
- 1: Pull-Down activated on Port B[i] when APC bit of PWRC CR1 bit is set
- 0: Pull-Down not activated on Port B[i]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EWUA</name>
          <displayName>EWUA</displayName>
          <description>EWUA register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>EWUA</name>
              <description>EWUA[x] Enable WakeUp line PA[x]
When this bit is set the PA[x] wakeup line is enabled and a rising or falling edge on wakeup line PA[x] will trigger a CPU wakeup event depending on CR7.WUPA[x] bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WUPA</name>
          <displayName>WUPA</displayName>
          <description>WUPA register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>WUPA</name>
              <description>WUPA[x] Wake-up Line PA[x] Polarity 
This bit defines the polarity used for event detection on external wake-up line PA[x]
- 0: Detection on high level (rising edge)
- 1: Detection on low level (falling edge)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WUFA</name>
          <displayName>WUFA</displayName>
          <description>WUFA register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>WUFA</name>
              <description>WUFA[x] WakeUp Flag PA[x]
This bit is set when a wakeup is detected on wakeup line PA[x]. It is cleared by a reset pad or by writing 1 in this bit field.
Writing 1 this bit, clears the interrupt:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EWUB</name>
          <displayName>EWUB</displayName>
          <description>EWUB register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>EWUB</name>
              <description>EWUB[x] Enable WakeUp line PB[x]
When this bit is set the PB[x] wakeup line is enabled and a rising or falling edge on wakeup line PB[x] will trigger a CPU wakeup event depending on CR9.WUPB[x] bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WUPB</name>
          <displayName>WUPB</displayName>
          <description>WUPB register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>WUPB</name>
              <description>WUPB[x] Wake-up Line PB[x] Polarity 
This bit defines the polarity used for event detection on external wake-up line PB[x]
- 0: Detection on high level (rising edge)
- 1: Detection on low level (falling edge)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WUFB</name>
          <displayName>WUFB</displayName>
          <description>WUFB register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>WUFB</name>
              <description>WUFB[x] WakeUp Flag PB[x]
This bit is set when a wakeup is detected on wakeup line PB[x]. It is cleared by a reset pad or by writing 1 in this bit field.
Writing 1 this bit, clears the interrupt:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDWN_WUEN</name>
          <displayName>SDWN_WUEN</displayName>
          <description>SDWN_WUEN register</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>WUEN</name>
              <description>WUEN PB0 I/O WakeUp from shutdown Enable
When this bit is set the PB0 wakeup from shutdown is enabled so that a rising or falling edge on PB0 (depending on SDWN_WUPOL..WUPOL bit) will trigger a CPU wakeup. It is cleared by a PORESETn.
- 0: PB0 wakeup from shutdown disabled
- 1: PB0 wakeup from shutdown enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDWN_WUPOL</name>
          <displayName>SDWN_WUPOL</displayName>
          <description>SDWN_WUPOL register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>WUPOL</name>
              <description>WUPOL PB0 I/O WakeUp from shutdown Polarity
This bit defines the polarity used for wakeup from shutdown detection on PB0 pin. It is cleared by a PORESETn.
- 0: Detection on high level  (rising edge)
- 1: Detection on low level  (falling edge)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDWN_WUF</name>
          <displayName>SDWN_WUF</displayName>
          <description>SDWN_WUF register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>WUF</name>
              <description>WUF PB0 I/O WakeUp from shutdown Flag
This bit is set when a wakeup from shutdown is detected on PB0 pin.  It is cleared by a PORESETn or by writing 0 in this bit field.
- 0: Shutdown wakeup from PB0 not occurred
- 1: Shutdown wakeup from PB0 occurred</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOF_TUNE</name>
          <displayName>BOF_TUNE</displayName>
          <description>BOF_TUNE register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>BOF_TUNE</name>
              <description>BOF_TUNE:  selection of the Bypass on the Fly LDO output voltage.
- 0:	1.2V
- 1:	1.2V
- 2:	1.2V
- 3:	1.3V
- 4:	1.4V (Default)
- 5:	1.5V
- 6:	1.6V
- 7:	1.7V
- 8:	1.8V
- 9:	1.9V
- 10:	2V
- 11:	2.1V
- 12:	2.2V
- 13:	2.3V
- 14:	2.4V
- 15:	2.4V</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGR</name>
          <displayName>DBGR</displayName>
          <description>DBGR register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>DEEPSTOP2</name>
              <description>DEEPSTOP2 low power saving mode emulation enable
this bit enable an emulated debug DEEPSTOP low power mode. 
If emulation is enabled, entering in DEEPSTOP mode, the v12i power domain still enters power saving mode, but its clock and power are maintained.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPSFRDY</name>
              <description>SMPSFB Force ready check 
When this bit is set, the SMPS regulator will be forced to operate in precharge mode. the actual state of  SMPS can be observed thanks to the replica SR2.SMPSBYPR.
- 0 : no effect (by default)
- 1 : SMPS is disabled and bypassed (ENABLE_3V3=0 and PRECHARGE_3V3=1)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KELVIN_TEST</name>
              <description>KELVIN_TEST[2:0]: Enable TEST mode Kelvin for LDO_RF (Write protected by IFR3 key)
- 000: 0mA (open) (default 0x0)
- 001 for 1mA
- 010 for 3mA
- 011 for 5mA
- 100 for 8mA
- 101 for 10mA
else: 0mA (open) for other combinations.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_PRECH</name>
              <description>DIS_PRECH[2:0]: disable precharge during deepstop (debug)
allowed combination are: 
- 111: precharge and SMPS monitoring are disabled (whatever CR5.SMPSLPOPEN)
- 101: precharge are activated only at deepstop exit (to be used only with CR5.SMPSLPOPEN=1) 
else: No effect (default 0x0)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTSRR</name>
          <displayName>EXTSRR</displayName>
          <description>EXTSRR register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>DEEPSTOPF</name>
              <description>DEEPSTOPF System DeepStop Flag
This bit is set by hardware and cleared only by a POR reset or by writing '1' in this bit field
- 0: System has not been in DEEPSTOP mode
- 1: System has been in DEEPSTOP mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFPHASEF</name>
              <description>RFPHASEF RFPHASE Flag
This bit is set by hardware after a S3LP wake-up event (S3LP activation); it
is cleared either by software, writing '1' in this bit field, or by hardware when Ready2Sleep signal is asserted by the Radio IP.
- 0: RF IP does not require attention
- 1: RF IP awake and requesting system attention</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
