KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL31.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SWITCHABLE</name>
      <groupName>SWITCHABLE</groupName>
      <baseAddress>0x49001040</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RFIP_VERSION</name>
          <displayName>RFIP_VERSION</displayName>
          <description>RFIP_VERSION register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00001100</resetValue>
          <fields>
            <field>
              <name>REVISION</name>
              <description>Revision of the RFIP to be used for metal fixes)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VERSION</name>
              <description>Version of the RFIP  (to be used for cut upgrades)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRODUCT</name>
              <description>Used for major upgrades (new protocols support / new features)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_ENABLE</name>
          <displayName>IRQ_ENABLE</displayName>
          <description>IRQ_ENABLE register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIT_SYNC_DETECTED_E</name>
              <description>Preamble has been detected, the content of the PAYLOAD_X registers is not yet valid.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME_SYNC_COMPLETE_E</name>
              <description>Frame Sync has been detected, the content of the PAYLOAD_X registers is not yet valid.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME_COMPLETE_E</name>
              <description>Frame ( payload + CRC) received, the content of the PAYLOAD_X registers is valid.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME_VALID_E</name>
              <description>Frame ( payload + CRC) received wthout error (the CRC has been checked and is matching with the received CRC).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <displayName>STATUS</displayName>
          <description>STATUS register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIT_SYNC_DETECTED_F</name>
              <description>Preamble has been detected, the content of the PAYLOAD_X registers is not yet valid.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME_SYNC_COMPLETE_F</name>
              <description>Frame Sync has been detected, the content of the PAYLOAD_X registers is not yet valid.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME_COMPLETE_F</name>
              <description>Frame ( payload + CRC) received, the content of the PAYLOAD_X registers is valid.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME_VALID_F</name>
              <description>Frame ( payload + CRC) received wthout error (the CRC has been checked and is matching with the received CRC).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_F</name>
              <description>- 11 : CRC error
</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>STATUS</name>
      <groupName>STATUS</groupName>
      <baseAddress>0x49000600</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RFSEQ_IRQ_STATUS</name>
          <displayName>RFSEQ_IRQ_STATUS</displayName>
          <description>RFSEQ_IRQ_STATUS register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TX_DONE_F</name>
              <description>Transmission done flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_OK_F</name>
              <description>Reception ended and OK flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_TIMEOUT_F</name>
              <description>Reception timeout flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_CRC_FRROR_F</name>
              <description>Reception with CRC error flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAST_RX_TERM_F</name>
              <description>Fast RX Termination flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXTIMER_STOP_CDT_F</name>
              <description>Enable interrupt on RXTIMER_STOP_CDT_F flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SABORT_DONE_F</name>
              <description>SABORT command treated and done flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMMAND_REJECTED_F</name>
              <description>Command rejection flag.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CS_F</name>
              <description>Carrier Sense (RSSI over threshold) flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PREAMBLE_VALID_F</name>
              <description>Valid PREAMBLE detection flag.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNC_VALID_F</name>
              <description>Valid SYNC word detection flag.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATABUFFER0_USED_F</name>
              <description>Data Buffer 0 fully read in TX or fully written in RX flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATABUFFER1_USED_F</name>
              <description>Data Buffer 1 fully read in TX or fully written in RX flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_ALMOST_FULL_0_F</name>
              <description>Data Buffer0 used (written during a RX) up to programmed thresold flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_ALMOST_FULL_1_F</name>
              <description>Data Buffer1 used (written during a RX) up to programmed thresold flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX_ALMOST_EMPTY_0_F</name>
              <description>Data Buffer0 used (read during a TX) up to programmed thresold flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX_ALMOST_EMPTY_1_F</name>
              <description>Data Buffer1 used (read during a TX) up to programmed thresold flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB_ACCESS_ERROR_F</name>
              <description>An AHB transfer issue occurred for one of the AHB masters (RRM, Data Buffer Manager, Sequencer).</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HW_ANA_FAILURE_F</name>
              <description>Analog HW failure flag (PLL lock / unlock error, calibration error)
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEQ_F</name>
              <description>Sequencer completion flag.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RRM_CMD_START_F</name>
              <description>RRM-UDRA command list execution started flag.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RRM_CMD_END_F</name>
              <description>RRM-UDRA command list execution ended flag.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAFEASK_CALIB_DONE_F</name>
              <description>End of Safe-ASK PA calibration flag.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AGC_CALIB_DONE_F</name>
              <description>Valid RSSI value available in the RSSI_RUNNING bit field flag.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RFSEQ_STATUS_DETAIL</name>
          <displayName>RFSEQ_STATUS_DETAIL</displayName>
          <description>RFSEQ_STATUS_DETAIL register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DBM_FIFO_ERROR_F</name>
              <description>Data Buffer Manager internal FIFO overflow/underflow flag.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_LOCK_FAIL_F</name>
              <description>PLL lock fail status flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_UNLOCK_F</name>
              <description>PLL unlock event flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_CALFREQ_ERROR_F</name>
              <description>VCO frequency calibration error flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL_CALAMP_ERROR_F</name>
              <description>VCO amplitude calibration error flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEQ_ACTIONTIMEOUT_F</name>
              <description>The Sequencer has ended because the current SeqAction reached its ActionTimeout.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEQ_COMPLETE_F</name>
              <description>The Sequencer has ended the last defined SeqAction properly( NextAction math or null pointer)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RADIO_FSM_INFO</name>
          <displayName>RADIO_FSM_INFO</displayName>
          <description>RADIO_FSM_INFO register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RADIO_FSM_STATE</name>
              <description>State of the Radio FSM
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_INDICATOR</name>
          <displayName>RX_INDICATOR</displayName>
          <description>RX_INDICATOR register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RSSI_LEVEL_ON_SYNC</name>
              <description>RSSI level captured at the end of the SYNC word detection of the received packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSSI_LEVEL_RUN</name>
              <description>Continuous level of the output of the measured RSSI value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AGC_WORD</name>
              <description>AGC word of the received packet.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ANT_SELECT</name>
              <description>Currently selected antenna</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_INFO_REG</name>
          <displayName>RX_INFO_REG</displayName>
          <description>RX_INFO_REG register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RX_PCKTLEN_OUT</name>
              <description>Indicates received packet length in bytes:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CRC_REG</name>
          <displayName>RX_CRC_REG</displayName>
          <description>RX_CRC_REG register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RX_CRC_OUT</name>
              <description>CRC field of the received packet (read-only info)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QI_INFO</name>
          <displayName>QI_INFO</displayName>
          <description>QI_INFO register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PQI_INFO</name>
              <description>Preamble Quality Indicator (PQI) value of the received packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SQI_INFO</name>
              <description>SYNC Quality Indicator (SQI) value of the received packet.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SQI_SEC</name>
              <description>Indicate if measured SQI refers to SYNC word or secondary SYNC word
</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AFC_CORRECTION</name>
              <description>AFC value frozen at sync reception.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATABUFFER_INFO</name>
          <displayName>DATABUFFER_INFO</displayName>
          <description>DATABUFFER_INFO register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CURRENT_DATABUFFER_COUNT</name>
              <description>Indicates the number of bytes used in the last used DATA BUFFER.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NB_DATABUFFER_USED</name>
              <description>Provides the number of data buffers which have been fully used
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CURRENT_DATABUFFER</name>
              <description>Indicates which Data Buffer is currently used by the HW
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIME_CAPTURE</name>
          <displayName>TIME_CAPTURE</displayName>
          <description>TIME_CAPTURE register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIME_CAPTURE</name>
              <description>Interpolated absolute time value captured on specific programmable event through TIME_CAPTURESEL[2:0] bit field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IQC_CORRECTION_OUT</name>
          <displayName>IQC_CORRECTION_OUT</displayName>
          <description>IQC_CORRECTION_OUT register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IQC_CORRECT_OUT</name>
              <description>Final correction value output from IQC (compensation  engine).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_SAFEASK_OUT</name>
          <displayName>PA_SAFEASK_OUT</displayName>
          <description>PA_SAFEASK_OUT register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PA_CODEMAX</name>
              <description>Safe ASK level (provided after a CALIB_SAFEASK command), indicating the maximum PA Power to program before reaching ohmic saturation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VCO_CALIB_OUT</name>
          <displayName>VCO_CALIB_OUT</displayName>
          <description>VCO_CALIB_OUT register</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000FF40</resetValue>
          <fields>
            <field>
              <name>VCO_CALFREQ_OUT</name>
              <description>VCO frequency calibration value currently output by the VCO calibration block (and applied on the VCO when ON)
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VCO_CALAMP_OUT</name>
              <description>VCO amplitude calibration value currently output by the VCO calibration block (and applied on the VCO when ON)
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
