KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WL31.svd
0000: TIMx_CH4 input

Others: Reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>USART</name>
      <groupName>USART</groupName>
      <baseAddress>0x41004000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USART</name>
        <description>USART interrupt</description>
        <value>8</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>CR1 register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UE</name>
              <description>UE: USART enable
When this bit is cleared, the USART prescalers and outputs are stopped immediately, and
current operations are discarded. The configuration of the USART is kept, but all the status
flags, in the USART_ISR are reset. This bit is set and cleared by software.
-0: USART prescaler and outputs disabled, low power mode
-1: USART enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RE</name>
              <description>RE: Receiver enable
This bit enables the receiver. It is set and cleared by software.
-0: Receiver is disabled
-1: Receiver is enabled and begins searching for a start bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TE</name>
              <description>TE: Transmitter enable
This bit enables the transmitter. It is set and cleared by software.
-0: Transmitter is disabled
-1: Transmitter is enabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLEIE</name>
              <description>IDLEIE: IDLE interrupt enable
This bit is set and cleared by software.
-0: Interrupt is inhibited
-1: A USART interrupt is generated whenever IDLE=1 in the USART_ISR register</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXNEIE_RXFNEIE</name>
              <description>RXNEIE/RXFNEIE: Receive data register not empty/RXFIFO not empty interrupt enable
This bit is set and cleared by software.
-0: Interrupt is inhibited
-1: An USART interrupt is generated whenever ORE=1 or RXNE/RXFNE=1 in the
USART_ISR register</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCIE</name>
              <description>TCIE: Transmission complete interrupt enable
This bit is set and cleared by software.
-0: Interrupt is inhibited
-1: A USART interrupt is generated whenever TC=1 in the USART_ISR register</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEIE_TXFNFIE</name>
              <description>TXEIE/TXFNFIE: Transmit data regsiter empty/TXFIFO not full interrupt enable
This bit is set and cleared by software.
-0: Interrupt is inhibited
-1: A USART interrupt is generated whenever TXE/TXFNF =1 in the USART_ISR register</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PEIE</name>
              <description>PEIE: PE interrupt enable
This bit is set and cleared by software.
-0: Interrupt is inhibited
-1: A USART interrupt is generated whenever PE=1 in the USART_ISR register</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PS</name>
              <description>PS: Parity selection
This bit selects the odd or even parity when the parity generation/detection is enabled (PCE
bit set). It is set and cleared by software. The parity will be selected after the current byte.
-0: Even parity
-1: Odd parity
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCE</name>
              <description>PCE: Parity control enable
This bit selects the hardware parity control (generation and detection). When the parity
control is enabled, the computed parity is inserted at the MSB position (9th bit if M=1; 8th bit
if M=0) and parity is checked on the received data. This bit is set and cleared by software.
Once it is set, PCE is active after the current byte (in reception and in transmission).
-0: Parity control disabled
-1: Parity control enabled
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKE</name>
              <description>WAKE: Receiver wakeup method
This bit determines the USART wakeup method from Mute mode. It is set or cleared by
software.
-0: Idle line
-1: Address mark
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M_0</name>
              <description>M0: Word length
This bit, with bit 28 (M1) determine the word length. It is set or cleared by software. See Bit
-28 (M1)description.
This bit can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MME</name>
              <description>MME: Mute mode enable
This bit activates the mute mode function of the USART. When set, the USART can switch
between the active and mute modes, as defined by the WAKE bit. It is set and cleared by
software.
-0: Receiver in active mode permanently
-1: Receiver can switch between mute mode and active mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMIE</name>
              <description>CMIE: Character match interrupt enable
This bit is set and cleared by software.
-0: Interrupt is inhibited
-1: A USART interrupt is generated when the CMF bit is set in the USART_ISR register.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVER8</name>
              <description>OVER8: Oversampling mode
-0: Oversampling by 16
This bit can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEDT</name>
              <description>DEDT[4:0]: Driver Enable deassertion time
This 5-bit value defines the time between the end of the last stop bit, in a transmitted
message, and the de-activation of the DE (Driver Enable) signal. It is expressed in sample
time units (1/8 or 1/16 bit time, depending on the oversampling rate).
If the USART_TDR register is written during the DEDT time, the new data is transmitted only
when the DEDT and DEAT times have both elapsed.
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEAT</name>
              <description>DEAT[4:0]: Driver Enable assertion time
This 5-bit value defines the time between the activation of the DE (Driver Enable) signal and
the beginning of the start bit. It is expressed in sample time units (1/8 or 1/16 bit time,
depending on the oversampling rate).
This bit field can only be written when the USART is disabled (UE=0).</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTOIE</name>
              <description>RTOIE: Receiver timeout interrupt enable
This bit is set and cleared by software.
-0: Interrupt is inhibited
-1: An USART interrupt is generated when the RTOF bit is set in the USART_ISR register</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EOBIE</name>
              <description>EOBIE: End of Block interrupt enable
This bit is set and cleared by software.
</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Interrupt is inhibited
</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>A USART interrupt is generated when the EOBF flag is set in the USART_ISR register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_1</name>
              <description>Word length
This bit, with bit 12 (M0) determine the word length. It is set or cleared by software.
M[1:0] = 00: 1 Start bit, 8 Data bits, n Stop bit
M[1:0] = 01: 1 Start bit, 9 Data bits, n Stop bit
M[1:0] = 10: 1 Start bit, 7 Data bits, n Stop bit
This bit can only be written when the USART is disabled (UE=0).s</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOEN</name>
              <description>FIFOEN :FIFO mode enable
This bit is set and cleared by software.
-0: FIFO mode is disabled.
-1: FIFO mode is enabled.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFEIE</name>
              <description>TXFEIE :TXFIFO empty interrupt enable
This bit is set and cleared by software.
-0: Interrupt is inhibited
-1: An USART interrupt is generated when TXFE=1 in the USART_ISR register</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFFIE</name>
              <description>RXFFIE :RXFIFO Full interrupt enable
This bit is set and cleared by software.
-0: Interrupt is inhibited
-1: An USART interrupt is generated when RXFF=1 in the USART_ISR register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
